andyelsen85-bit/Range-Master/artifacts/firmware/sdkconfig.defaults
# ── Target ────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision — Guition JC8012P4A1C uses ESP32-P4 rev v1.3 (ECO2) ───
# Use IDF 5.4.x — IDF 5.5+ targets ECO3 (v3.1+) and is incompatible with
# this chip. CONFIG_ESP32P4_REV_MIN_FULL=100 kept as a safety net.
CONFIG_ESP32P4_REV_MIN_FULL=100

# ── Flash (JC8012P4A1C has 16 MB flash) ───────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── PSRAM ─────────────────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ── MIPI DSI ──────────────────────────────────────────────────────────────
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── HTTP client ───────────────────────────────────────────────────────────
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ── NVS ───────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── UART ──────────────────────────────────────────────────────────────────
CONFIG_UART_ISR_IN_IRAM=y

# ── Log level ─────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Partition table ───────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── Stack sizes ───────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# ── LVGL Montserrat fonts (all sizes used by the UI screens) ──
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

